:: Настройка. Отключаем вывод на экран самых комманд скрипты
@echo off
COLOR 0E
mode 83,40
title HOTDOG

:: Русская кодировка консоли + фигня для переменных в бате :)
chcp 65001 > nul

setlocal EnableDelayedExpansion


echo ##################################################################################
echo #######   Ждем 5 минут и начнем (нажмите люб.клавишу, чтобы не ждать)    #########
echo ##################################################################################
@timeout /t 300 > NUL

:looping
cls
php -f HOTDOG.php
goto :looping