:: Настройка. Отключаем вывод на экран самых комманд скрипты
@echo off
COLOR 0E
mode 83,40
title HOTDOG

:: Русская кодировка консоли + фигня для переменных в бате :)
chcp 65001 > nul

setlocal EnableDelayedExpansion


echo ##################################################################################
echo ####### Ждем 4 минтуты и начнем                                         ##########
echo ##################################################################################
@timeout /t 240 /nobreak > NUL

:looping
cls
php -f HOTDOG.php
goto :looping